[
  {
    "title": "Anthropology",
    "url": "https://en.wikipedia.org/wiki/Anthropology",
    "page_details": "105 KB (11,549 words) - 20:03, 4 February 2022",
    "paragraph": "Anthropology is the scientific study of humanity, concerned with human behavior, human biology, cultures, societies, and linguistics, in both the present and past, including past human species.[1][2][3] Social anthropology studies patterns of behaviour, while cultural anthropology[1][2][3] studies cultural meaning, including norms and values. A portmanteau sociocultural anthropology[4] is commonly used today. Linguistic anthropology studies how language influences social life. Biological or physical anthropology[1][2][3] studies the biological development of humans.\n"
  },
  {
    "title": "Cultural anthropology",
    "url": "https://en.wikipedia.org/wiki/Cultural_anthropology",
    "page_details": "68 KB (8,011 words) - 17:36, 15 January 2022",
    "paragraph": "Cultural anthropology is a branch of anthropology focused on the study of cultural variation among humans. It is in contrast to social anthropology, which perceives cultural variation as a subset of a posited anthropological constant. The portmanteau term sociocultural anthropology includes both cultural and social anthropology traditions.[1]\nAnthropologists have pointed out that through culture people can adapt to their environment in non-genetic ways, so people living in different environments will often have different cultures. Much of anthropological theory has originated in an appreciation of and interest in the tension between the local (particular cultures) and the global (a universal human nature, or the web of connections between people in distinct places/circumstances).[2]\n"
  },
  {
    "title": "Social anthropology",
    "url": "https://en.wikipedia.org/wiki/Social_anthropology",
    "page_details": "31 KB (3,634 words) - 21:02, 26 November 2021",
    "paragraph": "Social anthropology is the study of patterns of behaviour in human societies and cultures. It is the dominant constituent of anthropology throughout the United Kingdom and Commonwealth and much of Europe,[1] where it is distinguished from cultural anthropology.[2] In the United States, social anthropology is commonly subsumed within cultural anthropology or sociocultural anthropology.[citation needed]\nThe term cultural anthropology is generally applied to ethnographic works that are holistic in spirit, are oriented to the ways in which culture affects individual experience, or aim to provide a rounded view of the knowledge, customs, and institutions of a people. Social anthropology is a term applied to ethnographic works that attempt to isolate a particular system of social relations such as those that comprise domestic life, economy, law, politics, or religion, give analytical priority to the organizational bases of social life, and attend to cultural phenomena as somewhat secondary to the main issues of social scientific inquiry.[3]\n"
  },
  {
    "title": "Biological anthropology",
    "url": "https://en.wikipedia.org/wiki/Biological_anthropology",
    "page_details": "16 KB (1,695 words) - 21:38, 18 January 2022",
    "paragraph": "Biological anthropology, also known as physical anthropology, is a scientific discipline concerned with the biological and behavioral aspects of human beings, their extinct hominin ancestors, and related non-human primates, particularly from an evolutionary perspective.[1] This subfield of anthropology systematically  studies human beings from a biological perspective.\nAs a subfield of anthropology, biological anthropology itself is further divided into several branches. All branches are united in their common orientation and/or application of evolutionary theory to understanding human biology and behavior.\n"
  },
  {
    "title": "Forensic anthropology",
    "url": "https://en.wikipedia.org/wiki/Forensic_anthropology",
    "page_details": "62 KB (6,269 words) - 00:00, 16 January 2022",
    "paragraph": "Forensic anthropology is the application of the anatomical science of anthropology and its various subfields, including forensic archaeology and forensic taphonomy,[1] in a legal setting. A forensic anthropologist can assist in the identification of deceased individuals whose remains are decomposed, burned, mutilated or otherwise unrecognizable, as might happen in a plane crash. Forensic anthropologists are also instrumental in the investigation and documentation of genocide and mass graves. Along with forensic pathologists, forensic dentists, and homicide investigators, forensic anthropologists commonly testify in court as expert witnesses.  Using physical markers present on a skeleton, a forensic anthropologist can potentially determine a person's age, sex, stature, and race. In addition to identifying physical characteristics of the individual, forensic anthropologists can use skeletal abnormalities to potentially determine cause of death, past trauma such as broken bones or medical procedures, as well as diseases such as bone cancer.\n"
  },
  {
    "title": "History of anthropology",
    "url": "https://en.wikipedia.org/wiki/History_of_anthropology",
    "page_details": "90 KB (11,415 words) - 20:39, 5 February 2022",
    "paragraph": "History of anthropology in this article refers primarily to the 18th- and 19th-century precursors of modern anthropology. The term anthropology itself, innovated as a New Latin scientific word during the Renaissance, has always meant \"the study (or science) of man\". The topics to be included and the terminology have varied historically. At present they are more elaborate than they were during the development of anthropology. For a presentation of modern social and cultural anthropology as they have developed in Britain, France, and North America since approximately 1900, see the relevant sections under Anthropology.\nThe term anthropology ostensibly is a produced compound of Greek ἄνθρωπος anthrōpos, \"human being\" (understood to mean \"humankind\" or \"humanity\"), and a supposed -λογία -logia, \"study\".[1] The compound, however, is unknown in ancient Greek or Latin, whether classical or mediaeval. It first appears sporadically in the scholarly Latin anthropologia of Renaissance France, where it spawns the French word anthropologie, transferred into English as anthropology. It does belong to a class of words produced with the -logy suffix, such as archeo-logy, bio-logy, etc., \"the study (or science) of\".\n"
  },
  {
    "title": "Medical anthropology",
    "url": "https://en.wikipedia.org/wiki/Medical_anthropology",
    "page_details": "28 KB (3,469 words) - 19:09, 5 January 2022",
    "paragraph": "Medical anthropology studies \"human health and disease, health care systems, and biocultural adaptation\".[1] It views humans from multidimensional and ecological perspectives.[2] It is one of the most highly developed areas of anthropology and applied anthropology,[3] and is a subfield of social and cultural anthropology that examines the ways in which culture and society are organized around or influenced by issues of health, health care and related issues.\nThe term \"medical anthropology\" has been used since 1963 as a label for empirical research and theoretical production by anthropologists into the social processes and cultural representations of health, illness and the nursing/care practices associated with these.[4]\n"
  },
  {
    "title": "Anthropology of religion",
    "url": "https://en.wikipedia.org/wiki/Anthropology_of_religion",
    "page_details": "16 KB (1,816 words) - 02:30, 24 January 2022",
    "paragraph": "Anthropology of religion is the study of religion in relation to other social institutions, and the comparison of religious beliefs and practices across cultures.[1]\nAbū Rayhān Bīrūnī (973–1048), wrote detailed comparative studies on the anthropology of religions and cultures across the Mediterranean Basin (including the so-called  \"Middle East\") and the Indian subcontinent.[2] He discussed the peoples, customs, and religions of the Indian subcontinent.\n"
  },
  {
    "title": "Linguistic anthropology",
    "url": "https://en.wikipedia.org/wiki/Linguistic_anthropology",
    "page_details": "33 KB (4,232 words) - 15:23, 2 January 2022",
    "paragraph": "Linguistic anthropology is the interdisciplinary study of how language influences social life. It is a branch of anthropology that originated from the endeavor to document endangered languages, and has grown over the past century to encompass most aspects of language structure and use.[1]\nLinguistic anthropology explores how language shapes communication, forms social identity and group membership, organizes large-scale cultural beliefs and ideologies, and develops a common cultural representation of natural and social worlds.[2]\n"
  },
  {
    "title": "Political anthropology",
    "url": "https://en.wikipedia.org/wiki/Political_anthropology",
    "page_details": "17 KB (2,414 words) - 00:39, 17 January 2022",
    "paragraph": "Political anthropology is a subfield of sociocultural anthropology, but like anthropology as a whole, it remains immune to precise delimitation. The core of political anthropology is the comparative, fieldwork-based examination of politics in a broad range of historical, social, and cultural settings.[1]\nPolitical anthropology has its roots in the 19th century. At that time, thinkers such as Lewis H. Morgan and Sir Henry Maine tried to trace the evolution of human society from 'primitive' or 'savage' societies to more 'advanced' ones. These early approaches were ethnocentric, speculative, and often racist. Nevertheless, they laid the basis for political anthropology by undertaking a modern study inspired by modern science, and in particular by Charles Darwin. In a move that would be influential for future anthropology, they focused on kinship as the key to understanding political organization, and emphasized the role of the 'gens' or lineage as an object of study.[2]\n"
  }
]